/******************************************************************************************************************
* 文 件 名：AUTOMATIC.C
* 功    能：侦测阅读器阅读范围内的所有卷标卡片。
*
* 作    者：EMDOOR
* 日    期：2011-9-29
********************************************************************************************************************/
#include <automatic.h>

/******************************************************************************************************************
* 函数名称：FindTags()
* 功    能：根据指定卷标协议类型，设置TRF7960配置各相关寄存器后，进行寻卡操作。
* 入口参数：protocol       指定协议类型
* 出口参数：无
* 说    明：该函数是一个死循环函数，所有的脱机演示执行过程均在此完成。
*******************************************************************************************************************/
void FindTags(void)
{
    unsigned char command[10];                      //定义命令数据暂存缓冲器数组

    while(1)
    {
            command[0] = ChipStateControl;          // 开启RF使能，选择5V操作模式
            command[1] = 0x21;
            command[2] = ISOControl;                // 设置选择ISO15693操作模式为:高比特率26.48kbps 单幅载波 1/4(默认模式)
            command[3] = 0x02;
            WriteSingle(command, 4);                // 写4个字节命令到TRF7960寄存器中

            delay_ms(5);
            flags = 0x06;                           // 16(slot)槽模式
            //flags = 0x26;

            command[0] = 0x04;

            InventoryRequest(command, 0);           // 发送总量请求命令(即寻卡命令)

            command[0] = ChipStateControl;          // 关闭RF部分电路
            command[1] = 0x01;
            WriteSingle(command, 2);
            delay_ms(1);

            command[0] = IRQStatus;                 // 给寄存器赋值
            command[1] = IRQMask;               

                                      
		    ReadCont(command, 2);							   //读取IRQ中断状态寄存器及中断标志
		
        delay_ms(10);
    }   /* while */
}   /* FindTags */




