/**********************************************************************************************************************************************************
* 文 件 名：COMMUNICATE.H
* 功    能：RFID阅读器TRF7960与MSP430F2370微控制器之间通信方式头文件。
* 硬件连接：MSP430F2370与TRF7960之间通信硬件连接关系如下所示：
*               MSP430F2370                 TRF7960
*********************    PARALLEL INTERFACE    ******************************************
*               P4.0(Pin26)                 DATA0(Pin17)
*               P4.1(Pin27)                 DATA1(Pin18)
*               P4.2(Pin28)                 DATA2(Pin19)
*               P4.3(Pin29)                 DATA3(Pin20)
*               P4.4(Pin30)                 DATA4(Pin21)
*               P4.5(Pin31)                 DATA5(Pin22)
*               P4.6(Pin32)                 DATA6(Pin23)
*               P4.7(Pin33)                 DATA7(Pin24)
*********************    SERIAL(SPI) INTERFACE    ***************************************           
*               P3.0(Pin18)                 Slave_select(Pin21)
*               P3.1(Pin19)                 SIMO(Pin24)
*               P3.2(Pin20)                 SOMI(Pin23)
*               P3.3(Pin21)                 DATA_CLK(Pin26)
*
* 版    本：V1.0
* 作    者：POWER
* 日    期：2009年05月18号
**********************************************************************************************************************************************************/
#ifndef COMMUNICATE_H
#define COMMUNICATE_H


#include <MSP430x23x0.h> 
#include <stdio.h>
#include "hardware.h"
#include "globals.h"
#include "host.h"

//#ifndef SPI_BITBANG
//#define SPI_BITBANG
//#endif

/******************************************************************************************************************
* 函数名称：PARset()
* 功    能：并行(PAR)模式配置函数
* 入口参数：无
* 出口参数：无
* 说    明：MSP430微控制器与TRF7960使用并行模式通信，并口模式初始化配置
******************************************************************************************************************/
void PARset(void);

/******************************************************************************************************************
* 函数名称：PARStopCondition()
* 功    能：并行(PAR)模式停止通信条件
* 入口参数：无
* 出口参数：无
* 说    明：MSP430微控制器与TRF7960使用并行模式通信，停止命令
******************************************************************************************************************/
void PARStopCondition(void);

/******************************************************************************************************************
* 函数名称：PARStopCont()
* 功    能：并行(PAR)连续模式停止通信条件
* 入口参数：无
* 出口参数：无
* 说    明：MSP430微控制器与TRF7960使用并行连续模式通信，停止命令
******************************************************************************************************************/
void PARStopCont(void);

/******************************************************************************************************************
* 函数名称：PARStartCondition()
* 功    能：并行(PAR)模式开始通信条件
* 入口参数：无
* 出口参数：无
* 说    明：MSP430微控制器与TRF7960使用并行模式通信，开始启动命令
******************************************************************************************************************/
void PARStartCondition(void);

/******************************************************************************************************************
* 函数名称：SPIStartCondition()
* 功    能：串行(SPI)模式开始通信条件
* 入口参数：无
* 出口参数：无
* 说    明：MSP430微控制器与TRF7960使用串行(SPI)模式通信，开始启动命令
******************************************************************************************************************/
void SPIStartCondition(void);

/******************************************************************************************************************
* 函数名称：SPIStopCondition()
* 功    能：串行(SPI)模式停止通信条件
* 入口参数：无
* 出口参数：无
* 说    明：MSP430微控制器与TRF7960使用串行(SPI)模式通信，停止命令
******************************************************************************************************************/
void SPIStopCondition(void);

/******************************************************************************************************************
* 函数名称：WriteSingle()
* 功    能：写单个寄存器或者特殊地址的多个寄存器命令
* 入口参数：*pbuf            将要写入的数据           
*           lenght           写入数据的长度 
* 出口参数：无
* 说    明：写命令。
******************************************************************************************************************/
void WriteSingle(unsigned char *pbuf, unsigned char lenght);

/******************************************************************************************************************
* 函数名称：WriteCont()
* 功    能：连续写寄存器或者特殊地址的多个寄存器命令
* 入口参数：*pbuf            将要写入的数据           
*           lenght           写入数据的长度 
* 出口参数：无
* 说    明：连续地址写命令。
******************************************************************************************************************/
void WriteCont(unsigned char *pbuf, unsigned char lenght);

/******************************************************************************************************************
* 函数名称：ReadSingle()
* 功    能：读单个寄存器
* 入口参数：*pbuf            将要读取的数据           
*           lenght           读取数据的长度 
* 出口参数：无
* 说    明：无
******************************************************************************************************************/
void ReadSingle(unsigned char *pbuf, unsigned char lenght);

/******************************************************************************************************************
* 函数名称：ReadCont()
* 功    能：连续读寄存器或者特殊地址的多个寄存器命令
* 入口参数：*pbuf            将要读取的数据           
*           lenght           读取数据的长度 
* 出口参数：无
* 说    明：连续地址写命令。
******************************************************************************************************************/
void ReadCont(unsigned char *pbuf, unsigned char lenght);

/******************************************************************************************************************
* 函数名称：DirectCommand()
* 功    能：直接命令可发送一个命令到阅读器芯片
* 入口参数：*pbuf            将要发送的命令数据           
* 出口参数：无
* 说    明：直接命令。
******************************************************************************************************************/
void DirectCommand(unsigned char *pbuf);

/******************************************************************************************************************
* 函数名称：RAWwrite()
* 功    能：直接写数据或命令到阅读器芯片
* 入口参数：*pbuf           将要发送的命令数据    
*           lenght          写入数据或命令的长度    
* 出口参数：无
* 说    明：直接写。
******************************************************************************************************************/
void RAWwrite(unsigned char *pbuf, unsigned char lenght);

/******************************************************************************************************************
* 函数名称：DirectMode()
* 功    能：直接模式，无停止条件
* 入口参数：无 
* 出口参数：无
* 说    明：无
******************************************************************************************************************/
void DirectMode(void);

/******************************************************************************************************************
* 函数名称：Response()
* 功    能：应答主机命令
* 入口参数：*pbuf       命令值      
*           lenght      命令值长度     
* 出口参数：无
* 说    明：发送应答主机命令字节
******************************************************************************************************************/
void Response(unsigned char *pbuf, unsigned char lenght);

/******************************************************************************************************************
* 函数名称：InitialSettings()
* 功    能：初始化TRF7960设置
* 入口参数：无 
* 出口参数：无
* 说    明：设置频率输出及调制深度
******************************************************************************************************************/
void InitialSettings(void);

/******************************************************************************************************************
* 函数名称：ReInitialize15693Settings()
* 功    能：重新初始化ISO15693设置
* 入口参数：无 
* 出口参数：无
* 说    明：包括重新初始化接收无应答等待时间和接收等待时间
******************************************************************************************************************/
void ReInitialize15693Settings(void);

/******************************************************************************************************************
* 函数名称：InterruptHandlerReader()
* 功    能：阅读器中断处理程序
* 入口参数：*Register           中断状态寄存器 
* 出口参数：无
* 说    明：处理外部中断服务程序
*           IRQ中断状态寄存器说明如下：
*
*   位      位名称      功能    			说明
*   B7      Irq_tx      TX结束而IRQ置位         指示TX正在处理中。该标志位在TX开始时被设置，但是中断请求是在TX完成时才发送。
*   B6      Irq_srx     RX开始而IRQ置位         指示RX SOF已经被接收到并且RX正在处理中。该标志位在RX开始时被设置，但是中断请求是在RX完成时才发送。
*   B5      Irq_fifo            指示FIFO为1/3>FIFO>2/3      指示FIFO高或者低（小于4或者大于8）。
*   B4      Irq_err1            CRC错误         	接收CRC
*   B3      Irq_err2            奇偶校验错误                    (在ISO15693和Tag-it协议中未使用)
*   B2      Irq_err3            字节成帧或者EOF错误	
*   B1      Irq_col     冲撞错误            ISO14443A和ISO15693单副载波。
*   B0      Irq_noresp          无响应中断          指示MCU可以发送下一个槽命令。
******************************************************************************************************************/
void InterruptHandlerReader(unsigned char *Register);

/******************************************************************************************************************
* 函数名称：Port_B()
* 功    能：阅读器中断入口程序
* 入口参数：无
* 出口参数：无
* 说    明：处理外部中断服务程序
******************************************************************************************************************/
#pragma vector=PORT2_VECTOR
__interrupt void Port_B(void);

#endif

