/**********************************************************************************************************************************************************
* 文 件 名：ISO14443.H
* 功    能：ISO14443A和ISO14443B协议卡片操作函数。包括仿冲撞处理等AUTOMATIC.C头文件。
*           该头文件包含了ISO14443协议和ISO14443B协议的演示函数。
*           注意：在传输和接收过程中，均需要通过FIFO操作。
* 版    本：V1.0
* 作    者：POWER
* 日    期：2009年05月18号
**********************************************************************************************************************************************************/
#ifndef ISO14443_H
#define ISO14443_H


#include <MSP430x23x0.h>        
#include "communicate.h"
#include <stdio.h>
#include "anticollision.h"
#include "globals.h"

extern unsigned char completeUID[14];               //声明完整的ISO14443协议UID码外部变量

/******************************************************************************************************************
* 函数名称：SelectCommand()
* 功    能：选择命令将入口参数值select写入到TRF7960的FIFO缓冲区中。
* 入口参数：select       协议串级数量
*           *UID         唯一标识码UID字符串变量
* 出口参数：ret     
* 说    明：若该函数返回数值0，则表示写入操作成功完成。
*******************************************************************************************************************/
char SelectCommand(unsigned char select, unsigned char *UID);

/******************************************************************************************************************
* 函数名称：AnticollisionLoopA()
* 功    能：ISO14443A仿冲撞循环。
* 入口参数：select       协议串级数量
*           NVB          有效字节数量
*           *UID         唯一标识码UID字符串变量
* 出口参数：无    
* 说    明：该函数递归函数，根据ISO14443A卡片UID码串级数量不同，递归调用次数不同。
*******************************************************************************************************************/
void AnticollisionLoopA(unsigned char select, unsigned char NVB, unsigned char *UID);

/******************************************************************************************************************
* 函数名称：AnticollisionSequenceA()
* 功    能：ISO14443A仿冲撞序列。
* 入口参数：REQA       请求命令
* 出口参数：无    
* 说    明：该函数根据REQA请求命令执行ISO14443A卡片不同操作。
            本脱机实验演示程序仅仅演示了读取UID码，故为0x00，为WUPA唤醒命令。
*******************************************************************************************************************/
void AnticollisionSequenceA(unsigned char REQA);

/******************************************************************************************************************
* 函数名称：Request14443A()
* 功    能：ISO14443A请求命令函数。
* 入口参数：pbuf       请求命令
*           lenght     命令长度
*           BitRate    比特率
* 出口参数：1 成功执行 0错误发生    
* 说    明：请求命令函数，能执行ISO14443A卡片的所有请求操作
*******************************************************************************************************************/
unsigned char Request14443A(unsigned char *pbuf, unsigned char lenght, unsigned char BitRate);

/******************************************************************************************************************
* 函数名称：SlotMarkerCommand()
* 功    能：该函数发送ISO14443B协议槽标记命令，该命令同时包括了槽号。
* 入口参数：number       槽号
* 出口参数：无    
* 说    明：无
*******************************************************************************************************************/
void SlotMarkerCommand(unsigned char number);

/******************************************************************************************************************
* 函数名称：AnticollisionSequenceB()
* 功    能：ISO14443B仿冲撞序列。
* 入口参数：command       请求命令
*           slots           槽号
* 出口参数：无    
* 说    明：该函数根据 command 请求命令和槽号slots执行ISO14443B卡片不同操作。
*******************************************************************************************************************/
void AnticollisionSequenceB(unsigned char command, unsigned char slots);

#endif



