/**********************************************************************************************************************************************************
* 文 件 名：TIRIS.H
* 功    能：TI公司Tag-it协议读写操作驱动函数头文件。
* 
* 版    本：V1.0
* 作    者：POWER
* 日    期：2009年05月18号
**********************************************************************************************************************************************************/
#ifndef TIRIS_H
#define TIRIS_H


#include <MSP430x23x0.h>   
#include "communicate.h"
#include <stdio.h>
#include "anticollision.h"
#include "globals.h"

/******************************************************************************************************************
* 函数名称：TIInventoryRequest()
* 功    能：主函数入口。
* 入口参数：*mask       命令值
*           length      数据长度
* 出口参数：无
* 说    明：Tag-it总量请求命令
*******************************************************************************************************************/
void TIInventoryRequest(unsigned char *mask, unsigned char lenght);

#endif
