/********************************************************************************************************
* 文 件 名：COMMUNICATE.H
* 功    能：RFID阅读器TRF7960与C8051F340微控制器之间通信方式头文件。
* 硬件连接：C8051F340与TRF7960之间通信硬件连接关系如下所示：
*                C8051F340                 TRF7960
*********************    PARALLEL INTERFACE    ******************************************         
*               P0.7   				 IRQ
*			    P0.3                 Slave_select
*               P0.2                 SIMO
*               P0.1                 SOMI
*               P0.0                 DATA_CLK
*				P4.0		       	 MOD
*				P4.2				 ASK/OOK
*				P4.3				 EN
*
* 版    本：V1.0
* 作    者：EMDOOR
* 日    期：2011-9-29
*********************************************************************************************************/
#ifndef COMMUNICATE_H
#define COMMUNICATE_H


#include <C8051F340.h> 
#include <stdio.h>
#include <hardware.h>
#include <globals.h>
#include <host.h>


/******************************************************************************************************************
* 函数名称：WriteSingle()
* 功    能：写单个寄存器或者特殊地址的多个寄存器命令
* 入口参数：*pbuf            将要写入的数据           
*           lenght           写入数据的长度 
* 出口参数：无
* 说    明：写命令。
******************************************************************************************************************/
void WriteSingle(unsigned char *pbuf, unsigned char lenght);
/******************************************************************************************************************
* ????:WriteCont()
* ?    ?:????????????????????
* ????:*pbuf            ???????           
*           lenght           ??????? 
* ????:?
* ?    ?:????????
******************************************************************************************************************/
void WriteCont(unsigned char *pbuf, unsigned char lenght);

/******************************************************************************************************************
* 函数名称：ReadSingle()
* 功    能：读单个寄存器
* 入口参数：*pbuf            将要读取的数据           
*           lenght           读取数据的长度 
* 出口参数：无
* 说    明：无
******************************************************************************************************************/
void ReadSingle(unsigned char *pbuf, unsigned char lenght);

/******************************************************************************************************************
* 函数名称：ReadCont()
* 功    能：连续读寄存器或者特殊地址的多个寄存器命令
* 入口参数：*pbuf            将要读取的数据           
*           lenght           读取数据的长度 
* 出口参数：无
* 说    明：连续地址写命令。
******************************************************************************************************************/
void ReadCont(unsigned char *pbuf, unsigned char lenght);

/******************************************************************************************************************
* 函数名称：DirectCommand()
* 功    能：直接命令可发送一个命令到阅读器芯片
* 入口参数：*pbuf            将要发送的命令数据           
* 出口参数：无
* 说    明：直接命令。
******************************************************************************************************************/
void DirectCommand(unsigned char *pbuf);

/******************************************************************************************************************
* 函数名称：RAWwrite()
* 功    能：直接写数据或命令到阅读器芯片
* 入口参数：*pbuf           将要发送的命令数据    
*           lenght          写入数据或命令的长度    
* 出口参数：无
* 说    明：直接写。
******************************************************************************************************************/
void RAWwrite(unsigned char *pbuf, unsigned char lenght);
/******************************************************************************************************************
* 函数名称：DirectMode()
* 功    能：直接模式，无停止条件
* 入口参数：无 
* 出口参数：无
* 说    明：无
******************************************************************************************************************/
void DirectMode(void);

/******************************************************************************************************************
* 函数名称：InitialSettings()
* 功    能：初始化TRF7960设置
* 入口参数：无 
* 出口参数：无
* 说    明：设置频率输出及调制深度
******************************************************************************************************************/
void InitialSettings(void);


/******************************************************************************************************************
* 函数名称：InterruptHandlerReader()
* 功    能：阅读器中断处理程序
* 入口参数：*Register           中断状态寄存器 
* 出口参数：无
* 说    明：处理外部中断服务程序
*           IRQ中断状态寄存器说明如下：
*
*   位      位名称      功能    			说明
*   B7      Irq_tx      TX结束而IRQ置位         指示TX正在处理中。该标志位在TX开始时被设置，但是中断请求是在TX完成时才发送。
*   B6      Irq_srx     RX开始而IRQ置位         指示RX SOF已经被接收到并且RX正在处理中。该标志位在RX开始时被设置，但是中断请求是在RX完成时才发送。
*   B5      Irq_fifo            指示FIFO为1/3>FIFO>2/3      指示FIFO高或者低（小于4或者大于8）。
*   B4      Irq_err1            CRC错误         	接收CRC
*   B3      Irq_err2            奇偶校验错误                    (在ISO15693和Tag-it协议中未使用)
*   B2      Irq_err3            字节成帧或者EOF错误	
*   B1      Irq_col     冲撞错误            ISO14443A和ISO15693单副载波。
*   B0      Irq_noresp          无响应中断          指示MCU可以发送下一个槽命令。
******************************************************************************************************************/
void InterruptHandlerReader(unsigned char *Register);

/******************************************************************************************************************
* 函数名称：Port_0()
* 功    能：阅读器中断入口程序
* 入口参数：无
* 出口参数：无
* 说    明：处理外部中断服务程序
******************************************************************************************************************/
void Port_0(void);

#endif 

